000_РОЗНИЦА_ЦЕНТР/src/Reports/РекламныеМатериалыКОтгрузке/РекламныеМатериалыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РекламныеМатериалыКОтгрузке</name>
</mdclass:Report>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/РекламныеМатериалыКОтгрузке/РекламныеМатериалыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РекламныеМатериалыКОтгрузке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РекламныйМатериал</name>
    <type>
      <types>CatalogRef.РекламныеМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РекламнаяПлоскость</name>
    <type>
      <types>CatalogRef.РекламныеПлоскости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПриемки</name>
    <type>
      <types>DocumentRef.ПриемкаРекламныхМатериалов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРаспоряжение</name>
    <type>
      <types>DocumentRef.РаспоряжениеНаПриемку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ОтгрузкаРекламныхМатериалов/ОтгрузкаРекламныхМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтгрузкаРекламныхМатериалов</name>
  <registerRecords>AccumulationRegister.РекламныеМатериалыКОтгрузке</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РекламныеМатериалы</name>
    <attributes>
      <name>РекламныйМатериал</name>
      <type>
        <types>CatalogRef.РекламныеМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекламнаяПлоскость</name>
      <type>
        <types>CatalogRef.РекламныеПлоскости</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПриемки</name>
      <type>
        <types>DocumentRef.ПриемкаРекламныхМатериалов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРаспоряжение</name>
      <type>
        <types>DocumentRef.РаспоряжениеНаПриемку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Reports/РекламныеМатериалыКОтгрузке/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция СоздатьДокументыОтгрузкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламныйМатериал КАК РекламныйМатериал,
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламнаяПлоскость КАК РекламнаяПлоскость,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение КАК ДокументРаспоряжение,
		|	СУММА(РекламныеМатериалыКОтгрузкеОстатки.КоличествоОстаток) КАК Количество,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументПриемки КАК ДокументПриемки
		|ИЗ
		|	РегистрНакопления.РекламныеМатериалыКОтгрузке.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Магазин = &Магазин) КАК РекламныеМатериалыКОтгрузкеОстатки
		|ГДЕ
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение.ДатаПо <= &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение,
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламныйМатериал,
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламнаяПлоскость,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументПриемки";
	
	Запрос.УстановитьПараметр("Магазин", ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин);
	Запрос.УстановитьПараметр("Организация",  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());

	
	РезультатЗапроса = Запрос.Выполнить();
ДокументСсылка = Неопределено;	
	Если НЕ РезультатЗапроса.Пустой() тогда 
		Док = Документы.ОтгрузкаРекламныхМатериалов.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.Организация = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику().ОсновнаяОрганизация; 
		Док.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин; 
		Док.РекламныеМатериалы.Загрузить(РезультатЗапроса.Выгрузить());
		Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Док.Записать();
		ДокументСсылка = Док.Ссылка;
	КонецЕсли;
	Возврат ДокументСсылка;
КонецФункции

&НаКлиенте
Процедура СоздатьДокументыОтгрузки(Команда)
	ДокументСсылка = СоздатьДокументыОтгрузкиНаСервере();
	Если ЗначениеЗаполнено(ДокументСсылка) тогда 
		ОткрытьЗначение(ДокументСсылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
ОбновитьНаСервере(Результат);
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере(ТабДок)
	   
	ТабДок.Очистить();
    ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
    
	Если Остатки тогда 
		СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанныхОстатки");
	Иначе
		СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КонецЕсли;
	
    Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
   	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	//ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиСКД, ЭтаФорма.УникальныйИдентификатор); 
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(Макет,,ДанныеРасшифровки);

    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ТабДок);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ДанныеРасшифровкиАдрес = ПоместитьВоВременноеХранилище(ДанныеРасшифровки,ЭтаФорма.УникальныйИдентификатор);

КонецПроцедуры



&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Результат.ОтображениеСостояния.Видимость = ложь; 
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПриИзменении(Элемент)
	ОбновитьНаСервере(Результат);
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
    Ссылка = ПолучитьДанныеРасшифровки(Расшифровка);
   
    Если Ссылка <> Неопределено Тогда
        СтандартнаяОбработка = Ложь;
    ОткрытьЗначение(Ссылка);
    КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПолучитьДанныеРасшифровки(Расшифровка)
    
    Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровкиАдрес);
    Поле = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();
    //Поле = Поля.Найти("Поле");

    Если Поле = Неопределено Тогда 
        Возврат Неопределено
    Иначе 
        Возврат Поле[0].Значение;
    КонецЕсли;    
	
	
КонецФункции
